/************************************************
 * @TITLE : 영화감독 숌
 * @LEVEL : Silver 5
 * @DATE : 2020-12-12
 * @NUMBER : 1436
 * @URL : https://www.acmicpc.net/problem/1436
 * @TIME : 2sec
 * @MEMORY : 128MB
 * @TIME : 21:48 ~ 22:26
 ************************************************
*/
#include <iostream>
using namespace std;
bool check666(int num)
{
    int cnt = 0;
    while (true)
    {
        if (num == 0 || cnt == 3)
        {
            break;
        }
        if (num % 10 == 6)
        {
            cnt++;
        }
        else
        {
            cnt = 0;
        }
        num /= 10;
    }
    return cnt == 3;
}
int main()
{
    int N;
    int result = 665;
    cin >> N;
    for (int i = 0; i < N; i++)
    {
        while (!check666(++result))
        {
        }
    }
    cout << result << "\n";
    return 0;
}

/*
************************************************
* TEST INPUT 1
************************************************
2
************************************************
* TEST OUTPUT 1
************************************************
1666
************************************************
*/

/********************************************************
 * @CATEGORY : 숫자 찾기
 * @Hint : 규칙을 찾는 거보다 그냥 찾는게 빠를 수 있음 깨닫기
 * ******************************************************/